<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="1,3,704,704" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="image"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>704</dim>
					<dim>704</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_7203_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="2" name="Constant_7203" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="Constant_7203"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="Gather_71874_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="2" size="1728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Gather_71874" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Multiply_68175" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="364, 365, Constant_10583, Divide_10584, backbone.features.init_block.bn.bias, backbone.features.init_block.bn.running_mean, backbone.features.init_block.bn.running_var, backbone.features.init_block.bn.weight, backbone.features.init_block.conv.weight"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>704</dim>
					<dim>704</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_68180_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1730" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_68180" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="365" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="365, backbone.features.init_block.bn.bias, backbone.features.init_block.bn.running_mean, backbone.features.init_block.bn.running_var, backbone.features.init_block.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="365">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="366" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="366"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="366">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Multiply_68581_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="1794" size="2048"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Multiply_68581" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Multiply_68182" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="367, 368, backbone.features.stage1.unit1.conv1.bn.bias, backbone.features.stage1.unit1.conv1.bn.running_mean, backbone.features.stage1.unit1.conv1.bn.running_var, backbone.features.stage1.unit1.conv1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_68187_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="3842" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_68187" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="368" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="368, backbone.features.stage1.unit1.conv1.bn.bias, backbone.features.stage1.unit1.conv1.bn.running_mean, backbone.features.stage1.unit1.conv1.bn.running_var, backbone.features.stage1.unit1.conv1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="368">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="369" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="369"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="369">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_68590_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="3906" size="576"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_68590" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Multiply_68189" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="371, backbone.features.stage1.unit1.conv2.bn.bias, backbone.features.stage1.unit1.conv2.bn.running_mean, backbone.features.stage1.unit1.conv2.bn.running_var, backbone.features.stage1.unit1.conv2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="370">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_68194_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="4482" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_68194" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="371" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="371, backbone.features.stage1.unit1.conv2.bn.bias, backbone.features.stage1.unit1.conv2.bn.running_mean, backbone.features.stage1.unit1.conv2.bn.running_var, backbone.features.stage1.unit1.conv2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="371">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="372" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="372"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="372">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Multiply_68598_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="4546" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Multiply_68598" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Multiply_68196" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="373, 374, backbone.features.stage1.unit1.conv3.bn.bias, backbone.features.stage1.unit1.conv3.bn.running_mean, backbone.features.stage1.unit1.conv3.bn.running_var, backbone.features.stage1.unit1.conv3.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_68201_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5570" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_68201" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="374" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="374, backbone.features.stage1.unit1.conv3.bn.bias, backbone.features.stage1.unit1.conv3.bn.running_mean, backbone.features.stage1.unit1.conv3.bn.running_var, backbone.features.stage1.unit1.conv3.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="374">
					<dim>1</dim>
					<dim>16</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Multiply_68607_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 16, 1, 1" offset="5602" size="3072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Multiply_68607" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Multiply_68203" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="375, 376, backbone.features.stage2.unit1.conv1.bn.bias, backbone.features.stage2.unit1.conv1.bn.running_mean, backbone.features.stage2.unit1.conv1.bn.running_var, backbone.features.stage2.unit1.conv1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_68208_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="8674" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_68208" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="376" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="376, backbone.features.stage2.unit1.conv1.bn.bias, backbone.features.stage2.unit1.conv1.bn.running_mean, backbone.features.stage2.unit1.conv1.bn.running_var, backbone.features.stage2.unit1.conv1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="376">
					<dim>1</dim>
					<dim>96</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="377" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="377"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="377">
					<dim>1</dim>
					<dim>96</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Multiply_68616_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 1, 1, 3, 3" offset="8866" size="1728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Multiply_68616" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Multiply_68210" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="379, backbone.features.stage2.unit1.conv2.bn.bias, backbone.features.stage2.unit1.conv2.bn.running_mean, backbone.features.stage2.unit1.conv2.bn.running_var, backbone.features.stage2.unit1.conv2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="378">
					<dim>1</dim>
					<dim>96</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_68215_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="10594" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_68215" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="379" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="379, backbone.features.stage2.unit1.conv2.bn.bias, backbone.features.stage2.unit1.conv2.bn.running_mean, backbone.features.stage2.unit1.conv2.bn.running_var, backbone.features.stage2.unit1.conv2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="379">
					<dim>1</dim>
					<dim>96</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="380" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="380"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="380">
					<dim>1</dim>
					<dim>96</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Multiply_68624_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 96, 1, 1" offset="10786" size="4608"/>
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Multiply_68624" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Multiply_68217" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="381, 382, backbone.features.stage2.unit1.conv3.bn.bias, backbone.features.stage2.unit1.conv3.bn.running_mean, backbone.features.stage2.unit1.conv3.bn.running_var, backbone.features.stage2.unit1.conv3.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_68222_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="15394" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_68222" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="382" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="382, backbone.features.stage2.unit1.conv3.bn.bias, backbone.features.stage2.unit1.conv3.bn.running_mean, backbone.features.stage2.unit1.conv3.bn.running_var, backbone.features.stage2.unit1.conv3.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="382">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Multiply_68633_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="15442" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Multiply_68633" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Multiply_68224" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="383, 384, backbone.features.stage2.unit2.conv1.bn.bias, backbone.features.stage2.unit2.conv1.bn.running_mean, backbone.features.stage2.unit2.conv1.bn.running_var, backbone.features.stage2.unit2.conv1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_68229_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="22354" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_68229" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="384" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="384, backbone.features.stage2.unit2.conv1.bn.bias, backbone.features.stage2.unit2.conv1.bn.running_mean, backbone.features.stage2.unit2.conv1.bn.running_var, backbone.features.stage2.unit2.conv1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="384">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="385" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="385"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="385">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Multiply_68642_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="22642" size="2592"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Multiply_68642" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Multiply_68231" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="387, backbone.features.stage2.unit2.conv2.bn.bias, backbone.features.stage2.unit2.conv2.bn.running_mean, backbone.features.stage2.unit2.conv2.bn.running_var, backbone.features.stage2.unit2.conv2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="386">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_68236_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="25234" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_68236" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="387" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="387, backbone.features.stage2.unit2.conv2.bn.bias, backbone.features.stage2.unit2.conv2.bn.running_mean, backbone.features.stage2.unit2.conv2.bn.running_var, backbone.features.stage2.unit2.conv2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="387">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="388" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="388"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="388">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Multiply_68650_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="25522" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Multiply_68650" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Multiply_68238" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="389, 390, backbone.features.stage2.unit2.conv3.bn.bias, backbone.features.stage2.unit2.conv3.bn.running_mean, backbone.features.stage2.unit2.conv3.bn.running_var, backbone.features.stage2.unit2.conv3.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_68243_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="32434" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_68243" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="390" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="390, backbone.features.stage2.unit2.conv3.bn.bias, backbone.features.stage2.unit2.conv3.bn.running_mean, backbone.features.stage2.unit2.conv3.bn.running_var, backbone.features.stage2.unit2.conv3.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="390">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="391" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="391"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="391">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Multiply_68659_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="32482" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Multiply_68659" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Multiply_68245" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="392, 393, backbone.features.stage3.unit1.conv1.bn.bias, backbone.features.stage3.unit1.conv1.bn.running_mean, backbone.features.stage3.unit1.conv1.bn.running_var, backbone.features.stage3.unit1.conv1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_68250_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="39394" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_68250" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="393" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="393, backbone.features.stage3.unit1.conv1.bn.bias, backbone.features.stage3.unit1.conv1.bn.running_mean, backbone.features.stage3.unit1.conv1.bn.running_var, backbone.features.stage3.unit1.conv1.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="393">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="394" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="394"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="394">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Multiply_68668_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="39682" size="2592"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Multiply_68668" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Multiply_68252" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="396, backbone.features.stage3.unit1.conv2.bn.bias, backbone.features.stage3.unit1.conv2.bn.running_mean, backbone.features.stage3.unit1.conv2.bn.running_var, backbone.features.stage3.unit1.conv2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="395">
					<dim>1</dim>
					<dim>144</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_68257_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="42274" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_68257" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="396" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="396, backbone.features.stage3.unit1.conv2.bn.bias, backbone.features.stage3.unit1.conv2.bn.running_mean, backbone.features.stage3.unit1.conv2.bn.running_var, backbone.features.stage3.unit1.conv2.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="396">
					<dim>1</dim>
					<dim>144</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="397" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="397"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="397">
					<dim>1</dim>
					<dim>144</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Multiply_68676_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 144, 1, 1" offset="42562" size="9216"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Multiply_68676" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Multiply_68259" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="398, 399, backbone.features.stage3.unit1.conv3.bn.bias, backbone.features.stage3.unit1.conv3.bn.running_mean, backbone.features.stage3.unit1.conv3.bn.running_var, backbone.features.stage3.unit1.conv3.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_68264_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="51778" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_68264" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="399" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="399, backbone.features.stage3.unit1.conv3.bn.bias, backbone.features.stage3.unit1.conv3.bn.running_mean, backbone.features.stage3.unit1.conv3.bn.running_var, backbone.features.stage3.unit1.conv3.bn.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="399">
					<dim>1</dim>
					<dim>32</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Multiply_68685_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 32, 1, 1" offset="51842" size="12288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
